snlkuharlocal/src/Documents/ЗаявкаНаЗакупкуСтороннегоАссортиментаФранчайзинг/ЗаявкаНаЗакупкуСтороннегоАссортиментаФранчайзинг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаЗакупкуСтороннегоАссортиментаФранчайзинг</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.ФР_Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>Линия</name>
    <type>
      <types>CatalogRef.ЛинииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Коллекция</name>
    <type>
      <types>CatalogRef.ФР_Коллекции</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрайсЛистЦена</name>
    <type>
      <types>DocumentRef.ПрайсЛист</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрайсЛистЦенаРаспродажи</name>
    <type>
      <types>DocumentRef.ПрайсЛист</types>
    </type>
  </attributes>
  <attributes>
    <name>Перемещение</name>
    <type>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеПереклейка</name>
    <type>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеНоменклатуры</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КодПроизводителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цвет</name>
      <type>
        <types>CatalogRef.Цвета</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЦвета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>CatalogRef.Размеры</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеРазмера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихКоды</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодИзФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РозничнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаРаспродажа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Себестоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеСтавкиНДС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеБрендаФР</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.ФР_ВидыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеВидаНоменклатуры</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Состав</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресПроизводителя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФилиалПроизводителя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресФилиалаПроизводителя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмпортерНаименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Импортер</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ИННИмпортера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КППИмпортера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресИмпортера</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСертификатаЕАС</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияСертификата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СертифицирующийОрган</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>27</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроизводитель</name>
      <type>
        <types>CatalogRef.КлассификаторСтранМира</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеСтраны</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяПереклейка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗамечанияКСтроке</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/РеквизитыСправочников/РеквизитыСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыСправочников</name>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Справочник</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/История/История.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>История</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>CatalogRef.Декларация</types>
      <types>CatalogRef.Подразделения</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.Контрагенты</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.ПунктыДоставки</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Договоры</types>
      <types>CatalogRef.ТНВЭД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ВводОстатковТМЦ</types>
      <types>DocumentRef.Декларация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Переоценка</types>
      <types>DocumentRef.Машина</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ВидБренда/ВидБренда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидБренда</name>
  <enumValues>
    <name>Наш</name>
  </enumValues>
  <enumValues>
    <name>Франчайзинг</name>
  </enumValues>
  <enumValues>
    <name>Агентский</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>НДС18</name>
    <comment>(Общ) Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>(Общ) Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>(Общ) Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>(Общ) Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС5</name>
    <comment>Новый НДС</comment>
  </enumValues>
  <enumValues>
    <name>НДС7</name>
    <comment>Новый НДС</comment>
  </enumValues>
  <enumValues>
    <name>НДС22</name>
    <comment>(Общ) Ставка НДС 22%</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыНоменклаутры/ВидыНоменклаутры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклаутры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ОсновноеСредство</name>
  </enumValues>
  <enumValues>
    <name>МБП</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>КомпьютернаяТехника</name>
  </enumValues>
  <enumValues>
    <name>РекламаПлатная</name>
  </enumValues>
  <enumValues>
    <name>РекламаБесплатная</name>
  </enumValues>
  <enumValues>
    <name>Упаковка</name>
  </enumValues>
  <enumValues>
    <name>ТМЦнаОтветственномХранении</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыШК/ВидыШК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыШК</name>
  <enumValues>
    <name>Основной</name>
  </enumValues>
  <enumValues>
    <name>Дополнительный</name>
  </enumValues>
  <enumValues>
    <name>Временный</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ФорматыШК/ФорматыШК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФорматыШК</name>
  <enumValues>
    <name>ITF14</name>
  </enumValues>
  <enumValues>
    <name>EAN13</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыДекларации/ВидыДекларации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДекларации</name>
  <enumValues>
    <name>Декларация</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>Свидетельство</name>
  </enumValues>
  <enumValues>
    <name>Удостоверение</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаявкаНаЗакупкуСтороннегоАссортиментаФранчайзинг/ManagerModule.bsl
////////////// ПОИСК //////////////////////////////////////////////////////////////////

Функция НайтиВидБренда(Номенклатура) Экспорт
	
	///// 1.Ищем по реквизитам ////////////////////////////////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫБОР
	|		КОГДА Номенклатура.ФР_Бренд.ВидБренда <> ЗНАЧЕНИЕ(Перечисление.ВидБренда.ПустаяСсылка)
	|			ТОГДА Номенклатура.ФР_Бренд.ВидБренда
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Номенклатура.Родитель.ФР_Бренд.ВидБренда <> ЗНАЧЕНИЕ(Перечисление.ВидБренда.ПустаяСсылка)
	|					ТОГДА Номенклатура.Родитель.ФР_Бренд.ВидБренда
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Номенклатура.Родитель.Родитель.ФР_Бренд.ВидБренда <> ЗНАЧЕНИЕ(Перечисление.ВидБренда.ПустаяСсылка)
	|							ТОГДА Номенклатура.Родитель.Родитель.ФР_Бренд.ВидБренда
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидБренда.ПустаяСсылка)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ВидБренда
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|	И НЕ Номенклатура.ПометкаУдаления";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.ВидБренда) Тогда
			Возврат Выборка.ВидБренда;
		КонецЕсли;
	КонецЕсли;
	
	////// 2. Если вид бренда пустой, то определяем вид бренда из иерархии
	
	ГруппаСтороннийАссортимент = ПолучитьЗначениеРеквизитыСправочников(,"СтороннийАссортимент");
	
	Если ГруппаСтороннийАссортимент <> Неопределено Тогда
		Если Номенклатура.ПринадлежитЭлементу(ГруппаСтороннийАссортимент) Тогда
			Возврат Перечисления.ВидБренда.Агентский;
		КонецЕсли;
	КонецЕсли;
	
	ГруппаФранчайзинг = ПолучитьЗначениеРеквизитыСправочников(,"Франчайзинг");
	
	Если ГруппаФранчайзинг <> Неопределено Тогда
		Если Номенклатура.ПринадлежитЭлементу(ГруппаФранчайзинг) Тогда
			Возврат Перечисления.ВидБренда.Франчайзинг;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Перечисления.ВидБренда.ПустаяСсылка();
	
КонецФункции

Функция ПоискСтавкиНДСПоНаименованию(Знач НаименованиеСтавкиНДС) Экспорт
	
	СтруктураНДС = Новый Структура("СтавкаНДС, ТекстОшибки", Неопределено, "");
	
	СтрокаПоиска = СокрЛП(НаименованиеСтавкиНДС);
	
	Если Найти(ВРЕГ(СтрокаПоиска), "БЕЗ") > 0 Тогда
		СтруктураНДС.Вставить("СтавкаНДС", Перечисления.СтавкиНДС.БезНДС);
	ИначеЕсли Найти(СтрокаПоиска, "10") > 0 Тогда
		СтруктураНДС.Вставить("СтавкаНДС", Перечисления.СтавкиНДС.НДС10);
	ИначеЕсли Найти(СтрокаПоиска, "20") > 0 Тогда
		СтруктураНДС.Вставить("СтавкаНДС", Перечисления.СтавкиНДС.НДС20);
	Иначе
		СтруктураНДС.Вставить("ТекстОшибки", "Не найдена СтавкаНДС");
	КонецЕсли;
	
	Возврат СтруктураНДС;
	
КонецФункции

Функция ПоискВидаНоменклатуры(Знач НаименованиеВидаНоменклатуры) Экспорт
	
	ВидНоменклатуры = Справочники.ФР_ВидыНоменклатуры.НайтиПоНаименованию(СокрЛП(НаименованиеВидаНоменклатуры));
	Если НЕ ВидНоменклатуры.Пустая() Тогда
		Возврат ВидНоменклатуры;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидНоменклатуры", "%" + СокрЛП(НаименованиеВидаНоменклатуры) + "%");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФР_ВидыНоменклатуры.Ссылка КАК ВидНоменклатуры
	|ИЗ
	|	Справочник.ФР_ВидыНоменклатуры КАК ФР_ВидыНоменклатуры
	|ГДЕ
	|	ФР_ВидыНоменклатуры.Наименование ПОДОБНО &ВидНоменклатуры
	|	И НЕ ФР_ВидыНоменклатуры.ПометкаУдаления
	|	И НЕ ФР_ВидыНоменклатуры.ЭтоГруппа";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВидНоменклатуры;
	Иначе
		Возврат Справочники.ФР_ВидыНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция ПоискГТД(ТекущаяСтрока) Экспорт
	
	Если ПустаяСтрока(ТекущаяСтрока.НомерГТД) ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.Модель) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерГТД", СокрЛП(ТекущаяСтрока.НомерГТД));
	Запрос.УстановитьПараметр("Модель", ТекущаяСтрока.Модель);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ГТД.Ссылка КАК НомерГТД
	|ИЗ
	|	Справочник.ГТД КАК ГТД
	|ГДЕ
	|	ГТД.Наименование = &НомерГТД
	|	И ГТД.Владелец = &Модель
	|	И НЕ ГТД.ПометкаУдаления
	|	И НЕ ГТД.ЭтоГруппа";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.НомерГТД;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПоискДекларации(ТекущаяСтрока) Экспорт
	
	Результат = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Модель) ИЛИ ПустаяСтрока(ТекущаяСтрока.НомерСертификатаЕАС) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", ТекущаяСтрока.Модель);
	Запрос.УстановитьПараметр("Наименование", СокрЛП(ТекущаяСтрока.НомерСертификатаЕАС));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Декларация.Ссылка КАК Декларация
	|ИЗ
	|	Справочник.Декларация КАК Декларация
	|ГДЕ
	|	Декларация.Наименование = &Наименование
	|	И Декларация.Объект = &Объект
	|	И НЕ Декларация.ПометкаУдаления
	|	И НЕ Декларация.ЭтоГруппа";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Декларация;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПоискКонтрагентаПоИНН(ТекущаяСтрока) Экспорт
	
	ФлагИННИностранногоКонтрагента = Ложь;
	Если НЕ ПустаяСтрока(ТекущаяСтрока.АдресИмпортера) Тогда
		Если Найти(ВРЕГ(ТекущаяСтрока.АдресИмпортера), "БЕЛАРУС") > 0 Тогда
			ФлагИННИностранногоКонтрагента = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИНН", ТекущаяСтрока.ИННИмпортера);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты." + ?(ФлагИННИностранногоКонтрагента, "ИННИностранногоКонтрагента = &ИНН", "ИНН = &ИНН") + "
	|	И НЕ Контрагенты.ЭтоГруппа
	|	И НЕ Контрагенты.ПометкаУдаления";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Контрагент;
	КонецЕсли;
	
	Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(ТекущаяСтрока.ИмпортерНаименование);
	Если НЕ Контрагент.Пустая() Тогда
		Возврат Контрагент;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПоискМоделиПоКодуПроизводителя_ТипуАртикулаКонтрагента(ДокОбъект, ТекущаяСтрока, КодПроизводителяВручную = "") Экспорт
	
	Запрос = Новый Запрос;
	
	Если СокрЛП(КодПроизводителяВручную) <> "" Тогда
		Запрос.УстановитьПараметр("КодПроизводителя", СокрЛП(КодПроизводителяВручную));
	Иначе
		Запрос.УстановитьПараметр("КодПроизводителя", СокрЛП(ТекущаяСтрока.КодПроизводителя));
	КонецЕсли;
	Запрос.УстановитьПараметр("ТипАртикулаКонтрагента", ДокОбъект.СкладПолучатель.Подразделение.ТипАртикулаКонтрагента);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АртикулыКонтрагентов.Владелец КАК Модель
	|ИЗ
	|	Справочник.АртикулыКонтрагентов КАК АртикулыКонтрагентов
	|ГДЕ
	|	АртикулыКонтрагентов.ТипАртикула = &ТипАртикулаКонтрагента
	|	И АртикулыКонтрагентов.Наименование = &КодПроизводителя
	|	И АртикулыКонтрагентов.Владелец.ЭтоГруппа
	|	И НЕ АртикулыКонтрагентов.Владелец.ПометкаУдаления";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Модель;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПоискШтрихкодаПоНоменклатуре_Наименованию(ТекущаяСтрока) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихкодИзФайла", СокрЛП(ТекущаяСтрока.ШтрихкодИзФайла));
	Запрос.УстановитьПараметр("Номенклатура", ТекущаяСтрока.Номенклатура);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихКоды.Ссылка КАК ШтрихКод
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.Наименование = &ШтрихкодИзФайла
	|	И ШтрихКоды.Владелец = &Номенклатура
	|	И НЕ ШтрихКоды.ПометкаУдаления
	|	И НЕ ШтрихКоды.Владелец.ПометкаУдаления";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ШтрихКод;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПоискПоШК(Знач ШтрихКод) Экспорт
	
	СтруктураШК = Новый Структура("Штрихкод, Номенклатура", Справочники.ШтрихКоды.ПустаяСсылка(), Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКод", СокрЛП(ШтрихКод));
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихКоды.Ссылка КАК ШтрихКод,
	|	ШтрихКоды.Владелец КАК Номенклатура
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.Наименование = &ШтрихКод
	|	И НЕ ШтрихКоды.ПометкаУдаления
	|	И НЕ ШтрихКоды.Владелец.ПометкаУдаления";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураШК, Выборка);
	КонецЕсли;
	
	Возврат СтруктураШК;
	
КонецФункции

Функция ПоискМоделиПоНаименованию(НаименованиеНоменклатуры, ОтборПоПапкеСтороннийАссортимент = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", СокрЛП(НаименованиеНоменклатуры));
	Если ОтборПоПапкеСтороннийАссортимент Тогда
		Запрос.УстановитьПараметр("ГруппаСтороннийАссортимент", ПолучитьЗначениеРеквизитыСправочников(,"СтороннийАссортимент"));
	КонецЕсли;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка КАК Модель
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Наименование = &Наименование
	|	" + ?(ОтборПоПапкеСтороннийАссортимент = Истина, "И Номенклатура.Ссылка В(&ГруппаСтороннийАссортимент)", "") + """
	|	И Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Модель;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЗначениеРеквизитыСправочников(Ссылка = Неопределено, ИмяРеквизита = "") Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ИмяРеквизита", ИмяРеквизита);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеквизитыСправочников.ЗначениеРеквизита КАК ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	|ГДЕ
	|	РеквизитыСправочников.ИмяРеквизита = &ИмяРеквизита
	|	" + ?(Ссылка = Неопределено, "", "И РеквизитыСправочников.Справочник = &Ссылка") + "";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ЗначениеРеквизита;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

////////////// ПОИСК НОМЕНКЛАТУРЫ ПО ЧЕТЫРЕМ ТОЧКАМ ///////////////////////////////////

Функция ПоискНоменклатурыПоКоду_ТипуАртикулаКонтрагента_Цвет_Размер(Код, ТипАртикулаКонтрагента, Цвет = Неопределено, Размер = Неопределено, НаходитсяВПапкеФранчайзинг = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Код", СокрЛП(Код));
	Запрос.УстановитьПараметр("ТипАртикулаКонтрагента", ТипАртикулаКонтрагента);
	Запрос.УстановитьПараметр("Цвет", Цвет);
	Запрос.УстановитьПараметр("Размер", Размер);
	
	Если НаходитсяВПапкеФранчайзинг Тогда
		Запрос.УстановитьПараметр("ПапкаФранчайзинг", ПолучитьЗначениеРеквизитыСправочников(,"Франчайзинг"));
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АртикулыКонтрагентов.Владелец КАК Номенклатура
	|ПОМЕСТИТЬ ГруппыНоменклатуры
	|ИЗ
	|	Справочник.АртикулыКонтрагентов КАК АртикулыКонтрагентов
	|ГДЕ
	|	АртикулыКонтрагентов.ТипАртикула = &ТипАртикулаКонтрагента
	|	И АртикулыКонтрагентов.Наименование = &Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СпрНоменклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	ГруппыНоменклатуры КАК ГруппыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО (ГруппыНоменклатуры.Номенклатура = СпрНоменклатура.Родитель
	|				ИЛИ ГруппыНоменклатуры.Номенклатура = СпрНоменклатура.Родитель.Родитель)
	|ГДЕ
	|	СпрНоменклатура.Цвет = &Цвет
	|	И СпрНоменклатура.Размер = &Размер
	|	И НЕ СпрНоменклатура.ПометкаУдаления
	|	И НЕ СпрНоменклатура.ЭтоГруппа
	|	" + ?(НаходитсяВПапкеФранчайзинг = Истина, "И СпрНоменклатура.Ссылка В ИЕРАРХИИ(&ПапкаФранчайзинг)", "") + "";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Номенклатура;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПоискНоменклатурыПоМодели_Цвет_Размер(Модель, Цвет = Неопределено, Размер = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Модель", Модель);
	Запрос.УстановитьПараметр("Цвет", Цвет);
	Запрос.УстановитьПараметр("Размер", Размер);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&Модель)
	|	И Номенклатура.Размер = &Размер
	|	И Номенклатура.Цвет = &Цвет
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И НЕ Номенклатура.ЭтоГруппа";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Номенклатура;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

////////////// ОБРАТНЫЙ ПОИСК АРТИКУЛОВ КОНТРАГЕНТА ПО НОМЕНКЛАТУРЕ ////////////////////

Функция ПоискТиповАртикуловПоНоменклатуре(Номенклатура) Экспорт
	
	МассивТипов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Родитель КАК Родитель
	|ПОМЕСТИТЬ Родители
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АртикулыКонтрагентов.Владелец КАК Владелец,
	|	АртикулыКонтрагентов.ТипАртикула КАК ТипАртикулаКонтрагента,
	|	АртикулыКонтрагентов.Наименование КАК КодПоставщика
	|ИЗ
	|	Справочник.АртикулыКонтрагентов КАК АртикулыКонтрагентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Родители КАК Родители
	|		ПО АртикулыКонтрагентов.Владелец = Родители.Родитель";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.ТипАртикулаКонтрагента) Тогда
			МассивТипов.Добавить(Выборка.ТипАртикулаКонтрагента);
		КонецЕсли;
	КонецЕсли;
	
	Возврат МассивТипов;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////////////			
////////////// СОЗДАНИЕ ЭЛЕМЕНТОВ СПРАВОЧНИКОВ ////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////

Функция СоздатьЭлементСправочникаЦвета(ТекущаяСтрока, ТекРодитель = Неопределено) Экспорт
	
	НовыйЦвет = Справочники.Цвета.СоздатьЭлемент();
	НовыйЦвет.Родитель = ?(ТекРодитель = Неопределено, Справочники.Цвета.НайтиПоКоду("20791"), ТекРодитель);
	НовыйЦвет.Наименование = ТекущаяСтрока.НаименованиеЦвета;
	НовыйЦвет.РусскоеНаименование = ТекущаяСтрока.НаименованиеЦвета;
	
	Попытка
		НовыйЦвет.Записать();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат НовыйЦвет.Ссылка;
	
КонецФункции

Функция СоздатьЭлементСправочникаРазмеры(ТекущаяСтрока, ТекРодитель = Неопределено) Экспорт
	
	НовыйРазмер = Справочники.Размеры.СоздатьЭлемент();
	НовыйРазмер.Родитель = ?(ТекРодитель = Неопределено, Справочники.Размеры.НайтиПоКоду("54185"), ТекРодитель);
	НовыйРазмер.Наименование = ТекущаяСтрока.НаименованиеРазмера;
	
	Попытка
		НовыйРазмер.Записать();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат НовыйРазмер.Ссылка;
	
КонецФункции

Функция СоздатьГруппуНоменклатуры(ДокОбъект, ТекущаяСтрока, ВПапкеФранчайзинга = Истина) Экспорт
	
	Модель = Справочники.Номенклатура.СоздатьГруппу();
	Модель.Наименование = ТекущаяСтрока.НаименованиеНоменклатуры;
	Модель.РусскоеНаименование = ТекущаяСтрока.НаименованиеНоменклатуры;
	Модель.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар;
	
	///////////////////////////////////////////////////////////////////////////////////
	Если ВПапкеФранчайзинга Тогда
		РодительМодели = ПоискМоделиПоКодуПроизводителя_ТипуАртикулаКонтрагента(ДокОбъект, ТекущаяСтрока, "КорневаяПапка");
		Если РодительМодели = Неопределено Тогда
			ТекущаяСтрока.ЗамечанияКСтроке = "Не найдена Корневая папка";
			Возврат Неопределено;
		Иначе
			Модель.Родитель = РодительМодели;
		КонецЕсли;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////////////
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.СтавкаНДС) Тогда
		Модель.СтавкаНДС = ТекущаяСтрока.СтавкаНДС;
	ИначеЕсли НЕ ЗначениеЗаполнено(ТекущаяСтрока.СтавкаНДС) И ЗначениеЗаполнено(ТекущаяСтрока.НаименованиеСтавкиНДС) Тогда
		Модель.СтавкаНДС = ПоискСтавкиНДСПоНаименованию(ТекущаяСтрока.НаименованиеСтавкиНДС);
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////////////////////
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.ВидНоменклатуры) Тогда
		Модель.ФР_ВидНоменклатуры = ТекущаяСтрока.ВидНоменклатуры;
	ИначеЕсли НЕ ЗначениеЗаполнено(ТекущаяСтрока.ВидНоменклатуры) И ЗначениеЗаполнено(ТекущаяСтрока.НаименованиеВидаНоменклатуры) Тогда
		ВидНоменклатуры = ПоискВидаНоменклатуры(ТекущаяСтрока.НаименованиеВидаНоменклатуры);
		Если ВидНоменклатуры.Пустая() Тогда
			ВидНоменклатуры = СоздатьВидНоменклатуры(ТекущаяСтрока.НаименованиеВидаНоменклатуры);
		КонецЕсли;
		Если ВидНоменклатуры <> Неопределено Тогда
			Модель.ФР_ВидНоменклатуры = ВидНоменклатуры;
		КонецЕсли;
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////////////////////
	
	Если ЗначениеЗаполнено(ДокОбъект.Бренд) Тогда
		Модель.ФР_Бренд = ДокОбъект.Бренд;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокОбъект.Линия) Тогда
		Модель.ФР_ЛинияНоменклатуры = ДокОбъект.Линия;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокОбъект.Коллекция) Тогда
		Модель.ФР_Коллекция = ДокОбъект.Коллекция;
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////////////////////
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.СтранаПроизводитель) Тогда
		Модель.Страна = ТекущаяСтрока.СтранаПроизводитель;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТекущаяСтрока.Состав) Тогда
		МассивПодстрок = РазложитьСтрокуВМассивПодстрок(ТекущаяСтрока.Состав, " ");
		Для Каждого Элемент ИЗ МассивПодстрок Цикл
			// сумма % из состава не превышает 100
			Если Найти(Элемент, "%") > 0 Тогда
				СтруктураВозврата = ЗаполнениеДокументов.ЦифрыСимволыЧисла(Элемент);
				Попытка
					Процент = Число(СтруктураВозврата.НовоеЗначение);
				Исключение
					Процент = 0;
				КонецПопытки;
			Иначе
				// материалы из текста есть в справочнике материалов
				Материал = Справочники.МатериалыСостав.НайтиПоНаименованию(Элемент, Ложь);
			КонецЕсли;
		КонецЦикла;
		Если НЕ Материал.Пустая() И Процент <> 0 Тогда
			НоваяСтрока = Модель.СоставНоменклатуры.Добавить();
			НоваяСтрока.МатериалСостав = Материал;
			НоваяСтрока.Процент = Процент;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		Модель.Записать();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Модель.Ссылка;
	
КонецФункции

// нужно создать элемент справочника АртикулыКонтрагентов.
// Тип артикула из подразделения, Наименование = КодПроизводителя, владелец – только что созданная группа
Функция СоздатьАртикулКонтрагента(ДокОбъект, ТекущаяСтрока) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Модель) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	АртикулКонтрагента = Справочники.АртикулыКонтрагентов.СоздатьЭлемент();
	АртикулКонтрагента.Владелец = ТекущаяСтрока.Модель;
	АртикулКонтрагента.Наименование = СокрЛП(ТекущаяСтрока.КодПроизводителя);
	АртикулКонтрагента.ТипАртикула = ДокОбъект.СкладПолучатель.Подразделение.ТипАртикулаКонтрагента;
	
	Попытка
		АртикулКонтрагента.Записать();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат АртикулКонтрагента.Ссылка;
	
КонецФункции

Функция СоздатьВидНоменклатуры(Знач НаименованиеВидаНоменклатуры) Экспорт
	
	ВидНоменклатуры = Справочники.ФР_ВидыНоменклатуры.СоздатьЭлемент();
	ВидНоменклатуры.Наименование = СокрЛП(НаименованиеВидаНоменклатуры);
	ВидНоменклатуры.ТипНоменклатуры = Перечисления.ВидыНоменклаутры.Товар;
	Попытка
		ВидНоменклатуры.Записать();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ВидНоменклатуры.Ссылка;
	
КонецФункции

Функция СоздатьЭлементНоменклатуры(ТекущаяСтрока) Экспорт
	
	Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
	Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар;
	
	// Наименование = НаименованиеБрендаФР + « » +Наименование модели + « »+ наименование цвета + « »  наименование размера
	Номенклатура.Наименование = СокрЛП(ТекущаяСтрока.НаименованиеБрендаФР) + " " + СокрЛП(ТекущаяСтрока.НаименованиеНоменклатуры) + " " +
		СокрЛП(ТекущаяСтрока.НаименованиеЦвета) + " " + СокрЛП(ТекущаяСтрока.НаименованиеРазмера);
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Модель) Тогда
		Номенклатура.Родитель = ТекущаяСтрока.Модель;
		Номенклатура.ПервичнаяГруппа = ТекущаяСтрока.Модель;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Цвет) Тогда
		Номенклатура.Цвет = ТекущаяСтрока.Цвет;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Размер) Тогда
		Номенклатура.Размер = ТекущаяСтрока.Размер;	
	КонецЕсли;
	
	Попытка
		Номенклатура.Записать();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Номенклатура.Ссылка;
	
КонецФункции

Функция СоздатьЭлементШтрихкодов(ТекущаяСтрока) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ШтрихКод = Справочники.ШтрихКоды.СоздатьЭлемент();
	
	ШтрихКод.УстановитьНовыйКод(ПолучитьПрефиксНомеров(ШтрихКод));
	
	ШтрихКод.Владелец = ТекущаяСтрока.Номенклатура;
	ШтрихКод.ВидШК = Перечисления.ВидыШК.Основной;
	ШтрихКод.ТипШК = Перечисления.ТипыШтрихКодов.Штука;
	
	Если ТекущаяСтрока.ТребуетсяПереклейка Тогда // нужно сгенерировать по правилам
		// Получаем максимальный номер ШК на 60
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПОДСТРОКА(ШтрихКоды.Наименование, 3, 10) КАК НомерШК
		|ИЗ
		|	Справочник.ШтрихКоды КАК ШтрихКоды
		|ГДЕ
		|	ПОДСТРОКА(ШтрихКоды.Наименование, 1, 1) = ""6""
		|	И ПОДСТРОКА(ШтрихКоды.Наименование, 3, 4) = ""0000""
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПОДСТРОКА(ШтрихКоды.Наименование, 3, 10) УБЫВ";
		
		УстановитьПривилегированныйРежим(Истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
	
		Если Выборка.Следующий() Тогда
			ТекущийШК = "600"+Формат(СокрЛП(Выборка.НомерШК),"ЧЦ=10; ЧРГ=; ЧВН=; ЧГ=0");
			СтруктураВозврата = ЗаполнениеДокументов.ЦифрыСимволыЧисла(СокрЛП(ТекущийШК));
			// Прибавляем единичку и получаем ШК
			Попытка
				ТекущийШК_Число = Число(СтруктураВозврата.НовоеЗначение) + 1;
				ШтрихКод.Наименование = Строка(ТекущийШК_Число);
			Исключение
				ШтрихКод.Наименование = СокрЛП(ТекущаяСтрока.ШтрихкодИзФайла);
			КонецПопытки;
		КонецЕсли;
	Иначе  // если в строке нет признака переклейки ШК, то наименование – это ШК из файла
		ШтрихКод.Наименование = СокрЛП(ТекущаяСтрока.ШтрихкодИзФайла);
	КонецЕсли;
	
	Если СтрДлина(ШтрихКод.Наименование) = 13 Тогда
		ШтрихКод.ФорматШК = Перечисления.ФорматыШК.EAN13;
	Иначе
		ШтрихКод.ФорматШК = Перечисления.ФорматыШК.ITF14;
	КонецЕсли;	
	
	Попытка
		ШтрихКод.ОбменДанными.Загрузка = Истина;
		ШтрихКод.Записать();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ШтрихКод.Ссылка;
	
КонецФункции

Функция СоздатьИмпортера(ТекущаяСтрока) Экспорт
	
	Если ПустаяСтрока(ТекущаяСтрока.ИмпортерНаименование) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Импортер = Справочники.Контрагенты.СоздатьЭлемент();
	Импортер.Наименование = ТекущаяСтрока.ИмпортерНаименование;
	
	Если Найти(ВРЕГ(ТекущаяСтрока.АдресИмпортера), "БЕЛАРУС") > 0 Тогда
		Импортер.ИННИностранногоКонтрагента = ТекущаяСтрока.ИННИмпортера;
		Импортер.ИНН = "00";
	Иначе
		Импортер.ИНН = ТекущаяСтрока.ИННИмпортера;
	КонецЕсли;
	
	Импортер.КПП = ТекущаяСтрока.КППИмпортера;
    Импортер.ПолноеНаименование = ТекущаяСтрока.ИмпортерНаименование;
	
    Импортер.Владелец = Справочники.ИБ.НайтиПоКоду("SSP");
    Импортер.Родитель = Справочники.Контрагенты.НайтиПоКоду("SSR-4946");
	
    Импортер.ЮридическийАдрес = СокрЛП(ТекущаяСтрока.АдресИмпортера);
    Импортер.ПочтовыйАдрес = СокрЛП(ТекущаяСтрока.АдресИмпортера);
	
	Попытка
		Импортер.Записать();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Импортер.Ссылка;
	
КонецФункции

Функция СоздатьЭлементГТД(ТекущаяСтрока) Экспорт
	
	Если ПустаяСтрока(ТекущаяСтрока.НомерГТД) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ГТД = Справочники.ГТД.СоздатьЭлемент();
    ГТД.Наименование = ТекущаяСтрока.НомерГТД;
	
    ГТД.Владелец = Справочники.ИБ.НайтиПоКоду("SSP");
    ГТД.Родитель = Справочники.ГТД.НайтиПоКоду("TZ2-188");
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Импортер) Тогда
	    ГТД.Импортер = ТекущаяСтрока.Импортер;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.СтранаПроизводитель) Тогда
		ГТД.СтранаПроисхождения = ТекущаяСтрока.СтранаПроизводитель;
	КонецЕсли;
	
	Попытка
		ГТД.Записать();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ГТД.Ссылка;
	
КонецФункции

Функция СоздатьЭлементДекларация(ТекущаяСтрока) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Модель) ИЛИ ПустаяСтрока(ТекущаяСтрока.НомерСертификатаЕАС) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Декларация = Справочники.Декларация.СоздатьЭлемент();
	Декларация.Наименование = СокрЛП(ТекущаяСтрока.НомерСертификатаЕАС);
	Декларация.Родитель = Справочники.Декларация.НайтиПоКоду("0009601");
	Декларация.ВидДокумента = Перечисления.ВидыДекларации.Сертификат;
	
    Декларация.Объект = ТекущаяСтрока.Модель;
    Декларация.ДатаНачала = Дата(2014,02,04);
	Если ЗначениеЗаполнено(ТекущаяСтрока.ДатаОкончанияСертификата) Тогда
    	Декларация.ДатаОкончания = ТекущаяСтрока.ДатаОкончанияСертификата;
	КонецЕсли;
                                               
	Если ЗначениеЗаполнено(ТекущаяСтрока.Импортер) Тогда
		Декларация.Организация = ТекущаяСтрока.Импортер;
	КонецЕсли;
	Если НЕ ПустаяСтрока(ТекущаяСтрока.Производитель) Тогда
    	Декларация.Изготовитель = СокрЛП(ТекущаяСтрока.Производитель);
	КонецЕсли;
	Если НЕ ПустаяСтрока(ТекущаяСтрока.СертифицирующийОрган) Тогда
    	Декларация.Орган = СокрЛП(ТекущаяСтрока.СертифицирующийОрган);
	КонецЕсли;
    Декларация.Сертификат = Перечисления.ОрганСертификации.ЕАС;
	
    Если ЗначениеЗаполнено(ТекущаяСтрока.ФилиалПроизводителя) Тогда
	    Декларация.Филиал = СокрЛП(ТекущаяСтрока.ФилиалПроизводителя);
    Иначе 
        Декларация.Филиал = СокрЛП(ТекущаяСтрока.АдресПроизводителя);
    КонецЕсли;
                
	Попытка
		Декларация.Записать();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Декларация.Ссылка;
	
КонецФункции

/////////////////// ЗАПИСЬ В РЕГИСТР СВЕДЕНИЙ ИСТОРИЯ ///////////////////////////////////
/// ИмяРеквизита = "НомерГТД"; "Декларация";  РегОбъект = Номенклатура;
Функция ЗаписатьВРегистрСведенийИстория(ДокОбъект, РегОбъект, Значение, ИмяРеквизита = "", Период = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", РегОбъект);
	Запрос.УстановитьПараметр("Значение", Значение);
	запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	История.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.История КАК История
	|ГДЕ
	|	История.Значение В(&Значение)
	|	И История.Объект = &Объект";
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 0 тогда
		НоваяЗапись = РегистрыСведений.История.СоздатьМенеджерЗаписи();
		НоваяЗапись.Объект = РегОбъект;                                 
		НоваяЗапись.Реквизит = ИмяРеквизита; 
		НоваяЗапись.Значение = Значение;
		НоваяЗапись.Период = ?(Период = Неопределено, НачалоДня(ТекущаяДата())-10, Период);          
		НоваяЗапись.Документ = ДокОбъект.Ссылка;
		НоваяЗапись.Записать();                                          
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции


// Кухарь А.Ю.  16.08.2023 начало
//
Функция ОпределитьТипАртикулаНоменклатурыФранчайзинга (Номенклатура) экспорт
	Запрос=новый запрос;
	запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	             |	АртикулыКонтрагентов.ТипАртикула КАК ТипАртикула
	             |ИЗ
	             |	Справочник.АртикулыКонтрагентов КАК АртикулыКонтрагентов
	             |ГДЕ
	             |	АртикулыКонтрагентов.Владелец = &Номенклатура
	             |	И не АртикулыКонтрагентов.ПометкаУдаления";
	Результат = запрос.Выполнить().Выбрать();
	пока Результат.Следующий() цикл
		возврат Результат.ТипАртикула;
	КонецЦикла;
	
	возврат Справочники.ТипыАтрикуловКонтрагентов.ПустаяСсылка();
	

КонецФункции
// Кухарь А.Ю.  16.08.2023 конец
